# Созадать словарь в качестве ключа которого будет 6-ти значное число,
# а в качестве значений кортеж состоящий из 2-х элементов – имя(str),
# возраст(int).  Сделать около 5-6 элементов словаря.
# Записать данный словарь на диск в json-файл.

import json

my_dict = [
    {
        666661: (
            {
                "Name": "Gul",
                "age": 21
            }
        ),
        666662: (
            {
                "Name": "Gag",
                "age": 22
            }
        ),
        666663: (
            {
                "Name": "Gor",
                "age": 23
            }
        ),
        666664: (
            {
                "Name": "Gim",
                "age": 24
            }
        ),
        666665: (
            {
                "Name": "Gon",
                "age": 25
            }
        ),
    }
]

with open('task.jason', 'w') as f:
    json.dump(my_dict, f)






